In [1]:
import pandas as pd 
import numpy as np

In [2]:
dataseries=[1,2.3,np.nan,"raj"]
print(pd.Series(dataseries))

0      1
1    2.3
2    NaN
3    raj
dtype: object

In [3]:
data = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "City": ["New York", "Los Angeles", "Chicago"]
}

In [4]:
df=pd.DataFrame(data)
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

iterrator

In [5]:
for index , row in df.iterrows():
    print(index ,":" , row)
    if index==0:
        break

0 : Name       Alice
Age           25
City    New York
Name: 0, dtype: object

In [6]:
ndata = {
    "majhd": [2077, 2077, 2077],
    "minorhd": [101, 101, 102],
    "vma": [100, 200, 0],
    "cma": [50, 150, 0],
    "vre": [0, 0, 100],
    "cre": [0, 0, 200],
    "vbe": [300, 400, 0],
    "cbe": [200, 300, 0],
}

In [7]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [11]:
import pandas as pd

# Example DataFrame (replace with actual data)



# class Navy Bud:
df = pd.DataFrame(ndata)

# Filter the data based on `majhd` and `minorhd`
filtered_df = df[(df["majhd"] == 2077) & (df["minorhd"] == 101)]

# Initialize variables for column sums
vma_sum = filtered_df["vma"].sum()
cma_sum = filtered_df["cma"].sum()
vre_sum = filtered_df["vre"].sum()
cre_sum = filtered_df["cre"].sum()
vbe_sum = filtered_df["vbe"].sum()
cbe_sum = filtered_df["cbe"].sum()

# Calculate `Navypaybud` using if-elif-else
if vma_sum > 0 or cma_sum > 0:
    navypaybud = (vma_sum + cma_sum) / 10000
elif vre_sum > 0 or cre_sum > 0:
    navypaybud = (vre_sum + cre_sum) / 10000
else:
    navypaybud = (vbe_sum + cbe_sum) / 10000

print("Navypaybud:", navypaybud)

Navypaybud: 0.05